{
    "THOMAS L JONES": " 16205046035  tomjonessecurity@proton.me Skills Summary Dynamic IT Technician and Developer with extensive experience in\ncomputer repair, network administration, and system optimization. Excels\nin web development, mobile application creation, and designing chatbots\nand AI agents. Experienced Cybersecurity Analyst skilled in OSINT (Open-\nSource Intelligence) and vulnerability testing, leveraging technical\nexpertise to deliver user-centric, innovative, and scalable solutions while\nensuring robust system security and compliance. Experience Rang Technologies\nContract Worker\n https://www.ellucian.com/ July 2024 - November 2024 Help Desk Representative for Ellucian SaaS, providing technical support and troubleshooting assistance for software-as-a-service (SaaS) solutions in the education sector. Successfully resolved user issues, ensured system accessibility, and delivered exceptional customer service while collaborating with cross-functional teams to maintain platform reliability and user satisfaction. Hutchinson Community College CSOC Analysist\n https://www.hutchcc.edu/ Jan 2024 - April 2024 Hutchinson, KS Cybersecurity Operations Center (CSOC) Analyst isresponsible for monitoring, analyzing, and responding to security threats to protect institutional data and systems. Conductined OSINT investigations, and incident response activities, ensuring a proactive approach to\ncybersecurity. Collaborated with IT teams to implement security best practices and maintain compliance with industry standards. Education Hutchinson Community College\nComputer Science\n https://www.hutchcc.edu/ Friends University\nCyberSecurity\n https://www.friends.edu/ August 2022 - July 2024 August 2024- current Help desk Support:\n• Proficient in troubleshooting\nhardware and software issues. •\nExperience in providing technical\nsupport to end-users and\nresolving IT-related problems. •\nKnowledgeable in ticketing\nsystems and maintaining detailed\ndocumentation. Cyber Security\nable to teach cyber security best\npractices to others in a relatable way. • Familiarity with security concepts, risk management, and access control. • CompTIA Security+ certified with a strong foundation in network security. • Understanding of cryptography, security architecture, and incident response. Technical Skills: • Operating Systems: Windows, Linux • Networking: TCP/IP, DNS, DHCP • Security Tools: Antivirus software, firewalls, intrusion detection/prevention systems Software and Programming:\n• Proficient in Microsoft Office\nSuite • Basic programming skills\nin Java and html 5 Certifications CompTIA A+ ce\nComptia Nov-30-2023 CompTIA Security+ ce\nComptia Apr-26-2024\n https://www.comptia.org/"
}